#if !defined(_NVVODHELP_H_)
#define _NVVODHELP_H_
#include "osp.h"


/**----------------------------------------------------------------------
* GetVodVer
* 
* @brief   获取版本信息
* 
* @return  s8*
* @see     
------------------------------------------------------------------------*/
extern s8* GetVodVer();

/**----------------------------------------------------------------------
* nvvodregcmd
* 
* @brief   注册osp调试命令
* 
* @param   void
* @return  void
* @see     
------------------------------------------------------------------------*/
extern void nvvodregcmd();

/**----------------------------------------------------------------------
* nvvodhelp
* 
* @brief   vod模块命令帮助
* 
* @param   void
* @return  void
* @see     
------------------------------------------------------------------------*/
API void nvvodhelp();
/**----------------------------------------------------------------------
* nvvodver
* 
* @brief   vod版本号显示
* 
* @param   void
* @return  void
* @see     
------------------------------------------------------------------------*/
API void nvvodver();

#endif // _NVVODHELP_H_