#if !defined(_AGENTADPNODE_H_)
#define _AGENTADPNODE_H_

#define NODE_BGN                    (200)

/*============================================================================
消息功能：设备注册成功
消息内容：NULL
消息流转：
============================================================================*/
#define NODE_DEVICE_LOGIN_ACK       (NODE_BGN + 1)

/*============================================================================
消息功能：设备注册失败
消息内容：TMsgDevRegNack
消息流转：
============================================================================*/
#define NODE_DEVICE_LOGIN_NACK      (NODE_BGN + 2)

/*============================================================================
消息功能：强制设备下线（备注：孙涛确认5.0网管已去除该功能，代码暂时还保留）
消息内容：
消息流转：
============================================================================*/
#define NODE_DEVICE_FORCE_OFFLINED  (NODE_BGN + 3)

/*============================================================================
消息功能：断链通知
消息内容：NULL
消息流转：
============================================================================*/
#define NODE_DISCONNECTED_NOTIFY    (NODE_BGN + 4)

/*============================================================================
消息功能：设备要求同步网管服务器时间(trap类型消息)或者网管同步自己时间到设备（set类型消息）
消息内容：作为trap时TMsgDevSynTimeTrap，作为set时为TMsgSetSynTimeReq
消息流转：
============================================================================*/
#define NODE_SYSTEM_SYNDEVTIME      (NODE_BGN + 5)

/*============================================================================
消息功能：设备配置信息
消息内容：TMsgGetDevCfgInfoAck
消息流转：
============================================================================*/
#define NODE_DEVICE_CFGINFO         (NODE_BGN + 6)

/*============================================================================
消息功能：设备性能信息
消息内容：trap时TMsgDevPfmTrap，get时TMsgGetDevPfmInfoAck
消息流转：
============================================================================*/
#define NODE_DEVICE_PFMINFO         (NODE_BGN + 7)

/*============================================================================
消息功能：发送字符消息
消息内容：TMsgSetSndMsgReq
消息流转：
============================================================================*/
#define NODE_SEND_MESSAGE           (NODE_BGN + 8)

/*============================================================================
消息功能：终端异常文件
消息内容：TMsgGetExceptionFileAck | TMsgExceptionFileTrap
消息流转：
============================================================================*/
#define NODE_EXCEPTION_FILE         (NODE_BGN + 9)

/*============================================================================
消息功能：设备告警
消息内容：TMsgDevAlarmTrap
消息流转：
============================================================================*/
#define NODE_DEVICE_ALARM           (NODE_BGN + 10)

/*============================================================================
消息功能：发送升级消息
消息内容：TMsgSetSndUpgradeMsgReq
消息流转：
============================================================================*/
#define NODE_SEND_UPGRADEMESSAGE    (NODE_BGN + 11)

/*============================================================================
消息功能：设备状态变更
消息内容：TMsgDevStateChangeTrap
消息流转：
============================================================================*/
#define NODE_DEV_CHANGE_STATE       (NODE_BGN + 12)

/*============================================================================
消息功能：查看终端当前会议状态
消息内容：TMsgGetDevConfStateInfoAck
消息流转：
============================================================================*/
#define NODE_CHECK_MT_CURSTATE	    (NODE_BGN + 13)

/****************************************************************************
 *
 *  TrueLink 上报的消息定义
 *
 ****************************************************************************/
 
/*============================================================================
消息功能：TrueLink 注册成功上报(TrueLink注册到网管后中途出现闪断，掉线等，如TL没有重启则此信息不再上报)
消息内容：TMsgDevLogInReportTrap
消息流转：
============================================================================*/
#define NODE_LOGIN_REPORTEDDATA    (NODE_BGN + 14)

/*============================================================================
消息功能：TrueLink 网管情况发生变化时上报
消息内容：TMsgDevNetworkChangeTrap
消息流转：
============================================================================*/
#define NODE_CHANGE_NETWORKINFO     (NODE_BGN + 15)

/*============================================================================
消息功能：TrueLink 参会时上报
消息内容：TMsgDevConfMediaDataTrap
消息流转：
============================================================================*/
#define NODE_REPORT_MEDIADATA_CONF   (NODE_BGN + 16)

/*============================================================================
消息功能：TrueLink CPU告警时上报
消息内容：TMsgDevCpuInfoTrap
消息流转：
============================================================================*/
#define NODE_REPORT_CPU_INFO        (NODE_BGN + 17)

#endif // _AGENTADPNODE_H_