#ifndef _NVBLLSYSCTRLMSG_H_
#define _NVBLLSYSCTRLMSG_H_

#include "nvmsgid.h"

#if !defined(_MESSAGE_HELP_)
enum EmBLLNvSysCtrlMsg
{
    EV_BLL_BGN(NVSYSCTRL) = EVSEG_BLL_SYSCTRL_BGN,
#endif

	/**********************************************************************************
	* < 绑定子系统（可一次绑定多个）>
	* ----------------------------------------------------------
	* 参数：TMutiTServiceInfo：多个TServiceInfo信息
	* ----------------------------------------------------------
	* 其中TServiceInfo的结构包括：
	* uint32 index：						索引号
	* uint32 nvaid：						每个子系统代表的NVAID号
	* string path：						子系统库的完整路径
	* string sysalias：					子系统别名
	* EmNvSysStartMod startmod：			子系统启动方式（静态库加载/动态库加载/进程加载）
	* string srtfuncname：				启动函数名称
	* string endfuncname：				结束函数名称
	* EmNvSysSrvState srvstate：			子系统状态（空闲/是否绑定/运行/停止/异常）
	* EmNvSysKeepLiveState srvklstate：	子系统存活状态（准备就绪/存活/异常）
	* uint32 time：						子系统心跳检测频率
	* uint32 timestamp：					用于检测心跳的时间戳
	* uint32 dllhandler：				加载动态库创建的句柄，用于销毁
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvsysctrl
	* ******************************************************************************** */ 
    MESSAGE(Ev_NV_BLL_SrvBind_Cmd)
	BODY(nv::TMutiTServiceInfo, MutiTServiceInfo)


	/**********************************************************************************
	* < 解除绑定子系统（可一次解绑多个）>
	* ----------------------------------------------------------
	* 参数：TMutiStr：多个string信息
	* string：		子系统绑定的别名，即TServiceInfo中的sysalias
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvsysctrl
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvUnBind_Cmd)
	BODY(nv::TMultiStr, Alias)


	/**********************************************************************************
	* < 启动子系统（一次只可启动一个）>
	* ----------------------------------------------------------
	* 参数：TString：	子系统绑定的别名，即TServiceInfo中的sysalias
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvsysctrl
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvStart_Cmd)
	BODY(nv::TString, Alias)


	/**********************************************************************************
	* < 启动子系统的结果上报 >
	* ----------------------------------------------------------
	* 参数：TBOOL32：			是否启动成功
	*       TSrvKeepLiveInfo：	若成功，则保存了当前子系统的一些信息。
	* ----------------------------------------------------------
	* 其中TSrvKeepLiveInfo的结构包含：
	* string sysalias：			子系统绑定的别名，即TServiceInfo中的sysalias
	* uint32 nvaid：				子系统绑定的NVAID号
	* uint32 time：				子系统的心跳频率
	* ----------------------------------------------------------
	* 发送方向：各个子系统 -> nvsysctrl -> nvsdk（看界面需要，是否需要发送到nvsdk）
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvStartResult_Ntf)
	BODY(nv::TBOOL32, SrvStartRlt)
	BODY(nv::TSrvKeepLiveInfo, SrvKeepLiveInfo)


	/**********************************************************************************
	* < 结束子系统（一次只可结束一个）>
	* ----------------------------------------------------------
	* 参数：TString：	子系统绑定的别名，即TServiceInfo中的sysalias
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvsysctrl
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvEnd_Cmd)
	BODY(nv::TString, Alias)


	/**********************************************************************************
	* < 结束子系统的结果上报>
	* ----------------------------------------------------------
	* 参数：TBOOL32：			是否启动成功
	* 参数：TU32：				子系统绑定的Nvaid，即TServiceInfo中的Nvaid
	* ----------------------------------------------------------
	* 发送方向：各个子系统 -> nvsysctrl -> nvsdk（看界面需要，是否需要发送到nvsdk）
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvEndtResult_Ntf)
	BODY(nv::TBOOL32, SrvEndRlt)
	BODY(nv::TU32, Nvaid)


	/**********************************************************************************
	* < 子系统心跳刷新>
	* ----------------------------------------------------------
	* 参数：	TU32：				NvAid号
	* ----------------------------------------------------------
	* 发送方向：各个子系统 -> nvsysctrl
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvKeepAlive_Ntf)  


	/**********************************************************************************
	* < 获取默认映射表内容 >
	* ----------------------------------------------------------
	* 参数：						无
	* ----------------------------------------------------------
	* 发送方向：暂时未定
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_GetDataShareSrvCmd)	


	/**********************************************************************************
	* < 添加默认映射表绑定的子系统（可一次增加多个）>
	* ----------------------------------------------------------
	* 参数：TMutiTServiceDefInfo：多个TServiceDefInfo信息
	* ----------------------------------------------------------
	* 其中TServiceDefInfo的结构包括：
	* uint32 index：						索引号
	* string path：						子系统库的完整路径
	* string sysalias：					子系统别名
	* EmNvSysStartMod startmod：			子系统启动方式（静态库加载/动态库加载/进程加载）
	* string srtfuncname：				启动函数名称
	* string endfuncname：				结束函数名称
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvsysctrl
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvAddSrvDefListCmd)
	BODY(nv::TMutiTServiceDefInfo, tMutiTServiceDefInfo)


	/**********************************************************************************
	* < 修改默认映射表绑定的子系统（可一次修改多个，根据别名/路径来判别修改项）>
	* ----------------------------------------------------------
	* 参数：TMutiTServiceDefInfo：多个TServiceDefInfo信息
	* ----------------------------------------------------------
	* 其中TServiceDefInfo的结构包括：
	* uint32 index：						索引号
	* string path：						子系统库的完整路径
	* string sysalias：					子系统别名
	* EmNvSysStartMod startmod：			子系统启动方式（静态库加载/动态库加载/进程加载）
	* string srtfuncname：				启动函数名称
	* string endfuncname：				结束函数名称
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvsysctrl
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvModifySrvDefListCmd)
	BODY(nv::TMutiTServiceDefInfo, tMutiTServiceDefInfo)


	/**********************************************************************************
	* < 删除默认映射表绑定的子系统（一次只可删除一项）>
	* ----------------------------------------------------------
	* 参数：TString：	子系统绑定的别名，即TServiceDefInfo中的sysalias
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvsysctrl
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_SrvDelSrvDefListCmd)
	BODY(nv::TString, MutiAlias)

	/**********************************************************************************
	* < 注册一个需要检测的模块>
	* ----------------------------------------------------------
	* 参数：TServiceInfo：	
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvservice
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_ThreadDetectRegCmd)
	BODY(nv::TServiceInfo, tServiceInfo)

	/**********************************************************************************
	* < 更新一个已注册模块的信息>
	* ----------------------------------------------------------
	* 参数：TServiceInfo：	
	* ----------------------------------------------------------
	* 发送方向：nvsdk -> nvservice
	* ******************************************************************************** */ 
	MESSAGE(Ev_NV_BLL_ThreadDetectUpdateCmd)
	BODY(nv::TU32, dwAppId)


 #if !defined(_MESSAGE_HELP_)
     EV_BLL_END(NVSYSCTRL) = EVSEG_BLL_SYSCTRL_END
};
#endif

#define Is_BLL_NvSysCtrl_Msg(m) ((m) >= EV_BLL_BGN(NVSYSCTRL) && (m) <= EV_BLL_END(NVSYSCTRL))

#endif