#include "mtospmsgid.h"

enum EmMDcsAdpMsg
{
	/*============================================================================
	消息功能：登录数字会议服务器响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_LoginSrv_Rsp = 0,

	
	/*============================================================================
	消息功能：保持与数字会议服务器之间的心跳连接响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_LoginSrv_KeepAlive_Rsp, 

	/*============================================================================
	消息功能：登出数字会议服务器响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DcsLogout_Rsp, 

	
	/*============================================================================
	消息功能：创建点对点数字会议请求响应
	消息内容：
	BODY(TDCSAdpCreateP2PConfResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DcsCreateConf_Rsp, 

	/*============================================================================
	消息功能：平台邀请用户入会
	消息内容：
	BODY(TDCSAdpInviteUsr, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_InviteUser_Cmd, //

	/*============================================================================
	消息功能：入会请求响应
	消息内容：
	BODY(TDCSAdpJoinConfResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_JoinConf_Rsp, 

	/*============================================================================
	消息功能：退会请求响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_QuitConf_Rsp, 

	/*============================================================================
	消息功能：向服务器结会请求响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_ReleaseConf_Rsp, 

	/*============================================================================
	消息功能：向服务器添加与会方响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_AddMember_Rsp, 

	/*============================================================================
	消息功能：向服务器删除与会方响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelMember_Rsp, 

	
	/*============================================================================
	消息功能：向服务器设置数值会议信息响应
	消息内容：
	BODY(TDCSAdpSetConfInfoResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_SetConfInfo_Rsp, 

	/*============================================================================
	消息功能：向服务器添加协作方响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_AddOperator_Rsp,

	/*============================================================================
	消息功能：向服务器删除协作方响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelOperator_Rsp,

	/*============================================================================
	消息功能：向服务器设置与会方角色响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
//	Ev_DcsAdp_SetUserRole_Rsp, 

	/*============================================================================
	消息功能：向服务器申请协作权响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_ApplyOper_Rsp, 

	/*============================================================================
	消息功能：向服务器请求取消协作权响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_CancelOper_Rsp, 

	/*============================================================================
	消息功能：向服务器请求用户列表信息响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	成功的话还会携带：
	BODY(TDCSAdpGetUserList, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_GetUserList_Rsp, 

	/*============================================================================
	消息功能：向服务器创建白板信息响应
	消息内容：
	BODY(TDCSAdpBoardResult, 1)
	成功的话还会携带：
	BODY(TDCSAdpBoardInfo, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_NewWhiteBoard_Rsp, 

	
	/*============================================================================
	消息功能：向服务器删除对应白板信息响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelWhiteBoard_Rsp, 


	/*============================================================================
	消息功能：向服务器删除所有白板信息响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelAllWhiteBoard_Rsp, 


	/*============================================================================
	消息功能：向服务器获取所有白板信息响应
	消息内容：
	BODY(TDCSAdpResult, 1)
	成功的话还会携带：
	BODY(TDCSAdpGetAllBoard, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_GetAllWhiteBoard_Rsp, 


	/*============================================================================
	消息功能：向服务器获取对应白板信息
	消息内容：
	BODY(TDCSAdpResult, 1)
	成功的话还会携带：
	BODY(TDCSAdpBoardInfo, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_GetWhiteBoard_Rsp, 

	/*============================================================================
	消息功能：向服务器获取当前白板信息
	消息内容：
	BODY(TDCSAdpResult, 1)
	成功的话还会携带：
	BODY(TDCSAdpBoardInfo, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_GetCurWhiteBoard_Rsp, 

	/*============================================================================
	消息功能：向服务器请求切换白板
	消息内容：
	BODY(TDCSAdpResult, 1)
	成功的话还会携带：
	BODY(TDCSAdpBoardInfo, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_Switch_Rsp, 


	/*============================================================================
	消息功能：入会请求通知
	消息内容：
	BODY(TDCSAdpUserInfo, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_UserJoinConf_Ntf, 

	
	/*============================================================================
	消息功能：退会请求通知
	消息内容：
	BODY(TDCSAdpUserInfo, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_UserQuitConf_Ntf, 

	
	/*============================================================================
	消息功能：结会请求通知
	消息内容：
	BODY(s8, MT_STR_LEN_32)	会议E164号
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_UserReleaseConf_Ntf, 

	
	/*============================================================================
	消息功能：添加与会方失败通知
	消息内容：
	BODY(TDCSAdpUserInfos, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_AddUserFail_Ntf, 


	/*============================================================================
	消息功能：删除与会方失败通知
	消息内容：
	BODY(TDCSAdpUserInfos, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelUserFail_Ntf,


	/*============================================================================
	消息功能：会议信息更新通知
	消息内容：
	BODY(TDCSAdpConfInfo, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_UpdateConfInfo_Ntf, 



	/*============================================================================
	消息功能：会议信息更新通知
	消息内容：
	BODY(TDCSAdpOperator, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_AddOperator_Ntf,

	/*============================================================================
	消息功能：会议信息更新通知
	消息内容：
	BODY(TDCSAdpOperator, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelOperator_Ntf,


	/*============================================================================
	消息功能：用户角色更新通知
	消息内容：
	BODY(TDCSAdpUserRole, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
//	Ev_DcsAdp_UpdateUserRole_Ntf, 


	/*============================================================================
	消息功能：用户角色更新失败通知
	消息内容：
	BODY(TDCSAdpUserRole, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
//	Ev_DcsAdp_SetUserRoleFail_Ntf, 

	
	/*============================================================================
	消息功能：用户申请协作方通知
	消息内容：
	BODY(TDCSAdpUserInfo, 1)	
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_UserApplyOper_Ntf,


	/*============================================================================
	消息功能：开启协作通知
	消息内容：
	BODY(s8, MT_STR_LEN_32)	   会议E164号
	消息流转：dcsadp->dcs
	============================================================================*/
//	Ev_DcsAdp_SpecOper_Ntf,

	/*============================================================================
	消息功能：用户取消协作方通知
	消息内容：
	BODY(s8, MT_STR_LEN_32)	   会议E164号
	消息流转：dcsadp->dcs
	============================================================================*/
//	Ev_DcsAdp_CancelOper_Ntf, 


	/*============================================================================
	消息功能：用户新建白板通知
	消息内容：
	BODY(TDCSAdpBoardInfo, 1)	   
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_NewWhiteBoard_Ntf, 


	/*============================================================================
	消息功能：用户删除白板通知
	消息内容：
	BODY(s8, 1)	   			会议E164号
	BODY(s8, 1)	   			白板索引
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelWhiteBoard_Ntf, 

	/*============================================================================
	消息功能：用户删除所有白板通知
	消息内容：
	BODY(s8, 1)	   			会议E164号
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DelAllWhiteBoard_Ntf, 


	/*============================================================================
	消息功能：用户切换白板通知
	消息内容：
	BODY(u32, 1)	   			白板索引
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_Switch_Ntf, 


	/*============================================================================
	消息功能：向服务器查询会议地址
	消息内容：
	BODY(TDCSAdpResult, 1)
	成功的话还会携带：
	BODY(TDCSAdpConfAddr, 1)
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_GetConfAddr_Rsp,


	/*============================================================================
	消息功能：协作申请拒绝通知
	消息内容：
	BODY(s8, 1)      会议E164
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_RejectOper_Ntf,

	/*============================================================================
	消息功能：挂断通知
	消息内容：
	BODY(s8, 1)      会议E164
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DropConfCall_Ntf,

	/*============================================================================
	消息功能：向原管理员通知: 取消管理员通知
	消息内容：
	BODY(s8, 1)      会议E164
	消息流转：dcsadp->dcs
	============================================================================*/
//	Ev_DcsAdp_CancelManager_Ntf,


	
	/*============================================================================
	消息功能：向新管理员通知: 成为管理员通知
	消息内容：
	BODY(s8, 1)      会议E164
	消息流转：dcsadp->dcs
	============================================================================*/
//	Ev_DcsAdp_SpecManager_Ntf,



	/*============================================================================
	消息功能：用户绘图操作通知（返回给发送者本身）
	消息内容：
	BODY(TDCSAdpOperContent, 1)	   			绘图操作类型
	BODY(X, 1)							
	此处根据不同的绘图类型，对应不同的结构，具体参见：
	mtdcsadpstructmsg.h中的枚举：EmDcsAdpOper
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DcsOper_Rsp, 

	/*============================================================================
	消息功能：用户绘图操作通知（来自其他人）
	消息内容：
	BODY(TDCSAdpOperContent, 1)	   			绘图操作类型
	BODY(X, 1)							
	此处根据不同的绘图类型，对应不同的结构，具体参见：
	mtdcsadpstructmsg.h中的枚举：EmDcsAdpOper
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DcsOper_Ntf,

	/*============================================================================
	消息功能：注册链路断链连接结果通知
	消息内容：TDCSConnectResult					
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_Login_Result_Ntf,


	/*============================================================================
	消息功能：会议中电子白板链路连接结果通知
	消息内容：TDCSConnectResult					
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_Conf_Result_Ntf,

	
	/*============================================================================
	消息功能：当前白板页通知
	消息内容：
	BODY(TDCSAdpBoardInfo, 1)		白板信息
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_CurrentWhiteBoard_Ntf,


	/*============================================================================
	消息功能：获取下载图片URL地址
	消息内容：
	BODY(TDCSAdpResult, 1)
	BODY(TDCSAdpImageUrl, 1)		图片信息
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DownloadImage_Rsp, 


	/*============================================================================
	消息功能：获取上传图片URL地址
	消息内容：
	BODY(TDCSAdpResult, 1)
	BODY(TDCSAdpImageUrl, 1)		图片信息
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_UploadImage_Rsp, 


	/*============================================================================
	消息功能：通知所有与会方，图片可下载通知
	消息内容：
	BODY(TDCSAdpImageUrl, 1)		图片信息
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_DownloadImage_Ntf,

	/*============================================================================
	消息功能：通知白板创建者，请求上传图片通知
	消息内容：
	BODY(TDCSAdpImageUrl, 1)		图片信息
	消息流转：dcsadp->dcs
	============================================================================*/
	Ev_DcsAdp_UploadImage_Ntf,

	/*============================================================================
	消息功能：文件上传结果通知消息
	消息内容：
	BODY(TDCSAdpFileLoadResult, 1)		文件路径名
	消息流转：dcsadp->dcs
	============================================================================*/
	//Ev_DcsAdp_UploadFile_Ntf,

	/*============================================================================
	消息功能：文件下载响应消息
	消息内容：
	BODY(TDCSAdpFileLoadResult, 1)		文件路径名
	消息流转：dcsadp->dcs
	============================================================================*/
	//Ev_DcsAdp_DownloadFile_Rsp,
};