//以下消息是AICamera 模块和device模块交互
#ifndef _CAMERA_DMSG_H_
#define _CAMERA_DMSG_H_
#include "mtospmsgid.h"


enum EmMtAICameraDMsg
{
	/*============================================================================
	消息功能：添加摄像机命令
	消息内容：TMtAddCamera	
	消息流转：api->AICamera
	============================================================================*/
	EV_AICamera_AddCamera_Cmd = EVSEG_MTOSPMSG_INNER_BGN + 0,

	/*===========================================================================
	消息功能：添加摄像机通知
	消息内容：TMtCameraInfo 
	消息流转：AICamera->Device
	============================================================================*/ 
	Ev_AICamera_AddCamera_Ntf,

	/*============================================================================
	消息功能：开启人数统计命令
	消息内容：TMtCameraCtrl
	消息流转：api->AICamera
	============================================================================*/
	Ev_AICamera_OpenPeopleCounting_Cmd,

	/*============================================================================
	消息功能：人数统计状态通知
	消息内容：TMtPeopleCountingState
	消息流转：AICamera->Device
	============================================================================*/
	Ev_AICamera_PeopleCountingState_Ntf,

	/*============================================================================
	消息功能：人数统计结果通知
	消息内容：TMtPeopleCountingResult
	消息流转：AICamera->Device
	============================================================================*/
	Ev_AICamera_PeopleCountingResult_Ntf,

	/*============================================================================
	消息功能：关闭人数统计命令
	消息内容：TMtCameraCtrl
	消息流转：api->AICamera
	============================================================================*/
	Ev_AICamera_ClosePeopleCounting_Cmd,

	/*============================================================================
	消息功能：开启人脸签到命令
	消息内容：TMtCameraCtrl
	消息流转：api->AICamera
	============================================================================*/
	Ev_AICamera_OpenFaceCheckIn_Cmd,

	/*============================================================================
	消息功能：人脸签到状态通知
	消息内容：TMtFaceCheckInState
	消息流转：AICamera->Device
	============================================================================*/
	Ev_AICamera_FaceCheckInState_Ntf ,

	/*============================================================================
	消息功能：人脸签到信息通知
	消息内容：TMtFaceCheckInInfos
	消息流转：AICamera->Device
	============================================================================*/
	Ev_AICamera_FaceCheckInInfo_Ntf,

	/*============================================================================
	消息功能：关闭人脸签到命令
	消息内容：TMtCameraCtrl 
	消息流转：api->AICamera
	============================================================================*/
	Ev_AICamera_CloseFaceCheckIn_Cmd,

	/*============================================================================
	消息功能：开启电子铭牌命令
	消息内容：TMtCameraCtrl 
	消息流转：api->AICamera
	============================================================================*/
	Ev_AICamera_OpenElectronicNamePlate_Cmd,

	/*============================================================================
	消息功能：电子铭牌状态通知
	消息内容：TMtElectronicNamePlateState
	消息流转：AICamera->Device
	============================================================================*/
	Ev_AICamera_ElectronicNamePlateState_Ntf,

	/*============================================================================
	消息功能：关闭电子铭牌命令
	消息内容：TMtCameraCtrl
	消息流转：api->AICamera
	============================================================================*/
	Ev_AICamera_CloseElectronicNamePlate_Cmd,

	/*============================================================================
	消息功能：删除摄像机
	消息内容：TMtCameraCtrl
	消息流转：api->AICamera
	============================================================================*/
	Ev_AICamera_DeleteCamera_Cmd,
	/*============================================================================
	消息功能：删除摄像机通知
	消息内容：bool值 0 表示成功,1表示失败
	消息流转：AICamera->Device
	============================================================================*/
	Ev_AICamera_DeleteCamera_Ntf,
	/*============================================================================
	消息功能：重连摄像机
	消息内容：无
	消息流转：AICamera发给自己
	============================================================================*/
	Ev_AICamera_Reconnect,

};

#endif