/**===========================================================================
 * @file    $Id$
 * @brief   负责IM业务模块的错误码定义
 * @author  $Author$
 * @date    $Date $
 * @version  $Revision$
 * (c)1998-2014 Suzhou Keda Technology Co.,Ltd. All rights reserved
 * @note
============================================================================*/

#ifndef _MTERRORCODE_MTREST_H_
#define _MTERRORCODE_MTREST_H_
#include "kdvtype.h"

/////////////////////////////////////////////////BEGIN DEFINE/////////////////////////////////////////////////

/**
 *@brief 错误码规则(10进制表示)
 *	 99                   99                    9             9999
 *	模块        +      子业务分类      +     错误等级    +   分配数量
 *(2位/100个)        （2位/100个）          （1位/10个）     (4位/10000个)
 */

/** MTCONF业务模块的子业务模块ID定义, 新增子业务分类定义只能往后追加 */
enum EM_ERR_SUBMOD_REST
{
	emErrSubModRest_ok		 = 1000,						// 正确
	emErrSubModRest_err_param_length_incorrect = 1001,     // 参数长度不对
	emErrSubModRest_err_invalid_handle		   = 1002,
	emErrSubModRest_err_invalid_argument	   = 1003,     // 参数不对
	emErrSubModRest_err_create_conf_overtime   = 1004,     //创会超时

	emErrSubModRest_err_pushsrv_net = 4000, ///< 推送服务器登录失败（对端服务器登录不上，返回404）

	emErrSubModRest_err_unknown = 10000,                        
};

//////////////////////////////////////////////////////////// Call //////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////  END DEFINE/////////////////////////////////////////////////

//////////////////////////////////////////////////////////// Chan //////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////END DEFINE/////////////////////////////////////////////////


//////////////////////////////////////////////////////////// Mtpa ////////////////////////////////////////////
 
/////////////////////////////////////////////////END DEFINE/////////////////////////////////////////////////
#endif // _MTERRORCODE_MTREST_H_