#if !defined(_MTVODHELP_H_)
#define _MTVODHELP_H_
#include "osp.h"


/**----------------------------------------------------------------------
* GetVodVer
* 
* @brief   获取版本信息
* 
* @return  s8*
* @see     
------------------------------------------------------------------------*/
extern s8* GetVodVer();

/**----------------------------------------------------------------------
* mtvodregcmd
* 
* @brief   注册osp调试命令
* 
* @param   void
* @return  void
* @see     
------------------------------------------------------------------------*/
extern void mtvodregcmd();

/**----------------------------------------------------------------------
* mtvodhelp
* 
* @brief   vod模块命令帮助
* 
* @param   void
* @return  void
* @see     
------------------------------------------------------------------------*/
API void mtvodhelp();
/**----------------------------------------------------------------------
* mtvodver
* 
* @brief   vod版本号显示
* 
* @param   void
* @return  void
* @see     
------------------------------------------------------------------------*/
API void mtvodver();

#endif // _MTVODHELP_H_